app/controllers/lots_controller.rb

SELECT "lots".* FROM "lots"
---
  def index
    @lots = Lot.all

SELECT "lots".* FROM "lots" WHERE "lots"."name" = 'Test' LIMIT 1
UPDATE "lots" SET "cars" = 2, "updated_at" = '2013-03-25 23:14:57.343109' WHERE "lots"."id" = 1
---
  def delta
    @lot = Lot.find_by_name(params[:name])

    respond_to do |format|
      if @lot.update_attributes(:cars => (@lot.cars + Integer(params[:delta])))

SELECT "lots".* FROM "lots" WHERE "lots"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @lot = Lot.find(params[:id])

SELECT "lots".* FROM "lots" WHERE "lots"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @lot = Lot.find(params[:id])

INSERT INTO "lots" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Fri, 08 Mar 2013 02:12:18 UTC +00:00], ["name", "Test"], ["updated_at", Fri, 08 Mar 2013 02:12:18 UTC +00:00]]
---
  def create
    @lot = Lot.new(params[:lot])

    respond_to do |format|
      if @lot.save

SELECT "lots".* FROM "lots" WHERE "lots"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "lots" SET "total_spots" = 10, "updated_at" = '2013-03-25 22:46:40.676761' WHERE "lots"."id" = 1
---
  def update
    @lot = Lot.find(params[:id])

    respond_to do |format|
      if @lot.update_attributes(params[:lot])